HotelManager/app/controllers/hotels_controller.rb

  def create
    @hotel = Hotel.new(hotel_params)

    if @hotel.save
---
INSERT INTO "hotels" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-07-22 05:36:54.012483"], ["updated_at", "2022-07-22 05:36:54.012483"]]